In [1]:
#importing the Libraies
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
dataset=pd.read_csv("Social_Network_Ads.csv")

In [3]:
dataset

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [4]:
dataset=pd.get_dummies(dataset,drop_first=True)

In [5]:
dataset

      User ID  Age  EstimatedSalary  Purchased  Gender_Male
0    15624510   19            19000          0            1
1    15810944   35            20000          0            1
2    15668575   26            43000          0            0
3    15603246   27            57000          0            0
4    15804002   19            76000          0            1
..        ...  ...              ...        ...          ...
395  15691863   46            41000          1            0
396  15706071   51            23000          1            1
397  15654296   50            20000          1            0
398  15755018   36            33000          0            1
399  15594041   49            36000          1            0

[400 rows x 5 columns]

In [6]:
dataset=dataset.drop("User ID",axis=1)

In [7]:
dataset

     Age  EstimatedSalary  Purchased  Gender_Male
0     19            19000          0            1
1     35            20000          0            1
2     26            43000          0            0
3     27            57000          0            0
4     19            76000          0            1
..   ...              ...        ...          ...
395   46            41000          1            0
396   51            23000          1            1
397   50            20000          1            0
398   36            33000          0            1
399   49            36000          1            0

[400 rows x 4 columns]

In [8]:
dataset["Purchased"].value_counts()
# if purchased is the target variable, need to figure out 
# 1. How many class we are going to classify
# 2. Is the data available is balanced or imbalanced
# Balanced dataset means if 0 is 257, 1 should also be 257 else imbalanced data
# If dataset is balanced there won't be any partiality in learning process
# for example, I have two students with same learning capacity, 
#for 1 student, I'm giving 30 mins and 1 matrerial to prepare for a test and for another student i"m giving 24hours and 5 materials to prepare for a test
#Now who will perform better -> Student 2 only
# likewise to train about "0" we 257 datasets but for 1 we have only 143 datasets
# upto 5% difference is allowed in realtime

#value_counts() will give unique values and number of occurance for each elements

0    257
1    143
Name: Purchased, dtype: int64

In [9]:
indep=dataset[["Age","EstimatedSalary","Gender_Male"]]
dep=dataset["Purchased"]

In [10]:
indep.shape

(400, 3)

In [11]:
dep

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [12]:
#split into training set and test
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(indep, dep, test_size = 1/3, random_state = 0)

In [13]:
from sklearn.ensemble import RandomForestClassifier
classifier = RandomForestClassifier(n_estimators = 10, criterion = 'entropy', random_state = 0)
classifier.fit(X_train, y_train)

RandomForestClassifier(criterion='entropy', n_estimators=10, random_state=0)

In [14]:
y_pred = classifier.predict(X_test)

In [15]:
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test, y_pred)

In [16]:
print(cm)

[[78  7]
 [ 6 43]]

In [17]:
from sklearn.metrics import classification_report
clf_report = classification_report(y_test, y_pred)

In [18]:
print(clf_report)
#ask
#What kind of project is this -> Classification
#What is model's accuracy -> 0.90 means 90%
#What is the recall of "0" -> 0.92 |"0" means not purchased "1" is purchased
#What is correct performance of purchased -> recall value of "1" is 0.88

              precision    recall  f1-score   support

           0       0.93      0.92      0.92        85
           1       0.86      0.88      0.87        49

    accuracy                           0.90       134
   macro avg       0.89      0.90      0.90       134
weighted avg       0.90      0.90      0.90       134

In [29]:
#Support columns is count of test data
#What is overall performance of the model for Decision Tree - Take "accuracy value" at f1-score column
#What is the correct classification of not purchased - Take Recall value of "0"

In [30]:
print(cm)

[[78  7]
 [ 6 43]]

In [26]:
# age_input=float(input("Age:"))
# salary_input=float(input("BMI:"))
# sex_male_input=int(input("Sex Male 0 or 1:"))

In [27]:
# classifier.predict([[age_input,salary_input,sex_male_input]])

In [28]:
# dir(clf_report)